title: Okta User Session Start Via An Anonymising Proxy Service
id: bde30855-5c53-4c18-ae90-1ff79ebc9578
status: test
description: Detects when an Okta user session starts from an anonymising proxy service.
references:
    - https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
author: Austin Songer @austinsonger
date: 2023-09-09
tags:
    - attack.defense_evasion
    - attack.t1562
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventType: 'user.session.start'
        securityContext.isProxy: 'true'
    condition: selection
falsepositives:
    - Legitimate use of VPN or proxy services by employees.
level: high
